*Data Cleaning (Pandas):*

This dataset helps you to increase the data-cleaning process using the pure Python pandas library.

Columns :
Age
Salary
Rating
Location
Established
Easy Apply
Here are some questions that you can follow to perform data cleaning and manipulation using the given dataset.
1. Missing Values:
Question: Are there any missing values in the dataset, and if so, how should they be handled for each indicator?

2. Data Types:
Question: What are the data types of each indicator, and do they align with their expected types (e.g., numerical, categorical)?

3. Outliers:
Question: Identify potential outliers in numerical indicators (e.g., Age, Salary, Rating). Should outliers be removed or adjusted?

4. Salary Formatting:
Question: Examine the format of the Salary column. Does it require any formatting or standardization for consistent analysis?

5. Location Standardization:
Question: Check the consistency of location entries. Do they need standardization, and how can this be achieved?

6. Established Column:
Question: Explore the Established column. Are there any inconsistencies or anomalies that need to be addressed?



7. Easy Apply Indicator:
Question: Analyze the Easy Apply column. Does it contain boolean values or need transformation for better analysis?

8. Rating Range:
Question: Investigate the range of values in the Rating column. Does it fall within expected rating scales, and how should outliers be treated?

9. Age Distribution:
Question: Check the distribution of values in the Age column. Are there any unusual entries, and how might they impact analysis?

10. Handling Special Characters:
Question: Examine all text-based columns (e.g., Location). Are there special characters or inconsistencies that need cleaning?

11. Data Integrity:
Question: Ensure data integrity by cross-referencing entries. For instance, does the Established column align with the Age column?

12. Easy Apply Transformation:
Question: If the Easy Apply column contains non-boolean values, how can it be transformed into a usable format?

13. Location Accuracy:
Question: Assess the accuracy of location entries. Are there misspelled or ambiguous locations that require correction?

14. Handling Categorical Data:
Question: For categorical indicators, consider encoding or transforming them into a format suitable for analysis.

15. Consistent Rating Scale:
Question: Ensure a consistent rating scale in the Rating column. Should it be normalized or adjusted for uniform analysis?

These questions cover various aspects of data cleaning and manipulation, guiding you through the process to enhance the quality and reliability of the dataset. Feel free to explore and find hidden patterns in the data.

***SOLUTION***

In [ ]:
# Step 1: Load the dataset into a Pandas DataFrame
import pandas as pd

# Load the dataset
dataset_path = "/content/Data-cleaning-for-beginners-using-pandas.csv"
df = pd.read_csv(dataset_path)
print(df)

    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       India,In         1999       TRUE
1       1  66.0   $55k-$66k     3.5    New York,Ny         2002       TRUE
2       2   NaN   $77k-$89k    -1.0    New York,Ny           -1         -1
3       3  64.0   $44k-$99k     4.4       India In         1988         -1
4       4  25.0   $44k-$99k     6.4  Australia Aus         2002         -1
5       5  44.0   $77k-$89k     1.4       India,In         1999       TRUE
6       6  21.0   $44k-$99k     0.0    New York,Ny           -1         -1
7       7  44.0   $44k-$99k    -1.0  Australia Aus           -1         -1
8       8  35.0   $44k-$99k     5.4    New York,Ny           -1         -1
9       9  22.0   $44k-$99k     7.7       India,In           -1       TRUE
10     10  55.0   $10k-$49k     5.4       India,In         2008       TRUE
11     11  44.0   $10k-$49k     6.7       India,In         2009         -1
12     12   NaN   $44k-$99k     0.0       India,In         1999         -1
13     13  25.0   $44k-$99k    -1.0  Australia Aus         2019       TRUE
14     14  66.0   $44k-$99k     4.0  Australia Aus         2020       TRUE
15     15  44.0  $88k-$101k     3.0  Australia Aus         1999         -1
16     16  19.0   $19k-$40k     4.5       India,In         1984         -1
17     17   NaN   $44k-$99k     5.3    New York,Ny         1943       TRUE
18     18  35.0   $44k-$99k     6.7    New York,Ny         1954       TRUE
19     19  32.0   $44k-$99k     3.3    New York,Ny         1955       TRUE
20     20   NaN   $44k-$99k     5.7    New York,Ny         1944       TRUE
21     21  35.0   $44k-$99k     5.0    New York,Ny         1946         -1
22     22  19.0   $55k-$66k     7.8    New York,Ny         1988       TRUE
23     23   NaN   $44k-$99k     2.4    New York,Ny         1999       TRUE
24     24  13.0   $44k-$99k    -1.0    New York,Ny         1987         -1
25     25  55.0   $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26   NaN   $55k-$66k     NaN       India,In         1934       TRUE
27     27  52.0   $44k-$99k     5.4       India,In         1935         -1
28     28   NaN   $39k-$88k     3.4  Australia Aus         1932         -1

In [ ]:
# Step 2: Identify Missing Values
missing_values = df.isnull().sum()

# Print the count of missing values in each column
print("Missing values in each column:")
print(missing_values)

Missing values in each column:
Index          0
Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64

In [ ]:
# Step 3: Handle Missing Values
# Example: Replace missing values with the mean in the 'Age' column
mean_age = df['Age'].mean()
df['Age'].fillna(mean_age, inplace=True)

# Example: Replace missing values with the mean in the 'Rating' column
mean_rating = df['Rating'].mean()
df['Rating'].fillna(mean_rating, inplace=True)

In [ ]:
# Step 4: Confirm Handling
# Check again for missing values after handling
missing_values_after_handling = df.isnull().sum()

# Print the count of missing values in each column
print("Missing values in each column after handling:")
print(missing_values_after_handling)

Missing values in each column after handling:
Index          0
Age            0
Salary         0
Rating         0
Location       0
Established    0
Easy Apply     0
dtype: int64

In [ ]:
# Step 1: Check Data Types
data_types = df.dtypes

# Print the data types of each column
print("Data types of each column:")
print(data_types)

Data types of each column:
Index            int64
Age            float64
Salary          object
Rating         float64
Location        object
Established      int64
Easy Apply      object
dtype: object

In [ ]:
# Step 1: Replace NaN values in 'Age' column with average age
average_age = df['Age'].mean()
df['Age'] = df['Age'].fillna(average_age).astype(int)

In [ ]:
print(df)

    Index  Age      Salary    Rating       Location  Established Easy Apply
0       0   44   $44k-$99k  5.400000       India,In         1999       TRUE
1       1   66   $55k-$66k  3.500000    New York,Ny         2002       TRUE
2       2   39   $77k-$89k -1.000000    New York,Ny           -1         -1
3       3   64   $44k-$99k  4.400000       India In         1988         -1
4       4   25   $44k-$99k  6.400000  Australia Aus         2002         -1
5       5   44   $77k-$89k  1.400000       India,In         1999       TRUE
6       6   21   $44k-$99k  0.000000    New York,Ny           -1         -1
7       7   44   $44k-$99k -1.000000  Australia Aus           -1         -1
8       8   35   $44k-$99k  5.400000    New York,Ny           -1         -1
9       9   22   $44k-$99k  7.700000       India,In           -1       TRUE
10     10   55   $10k-$49k  5.400000       India,In         2008       TRUE
11     11   44   $10k-$49k  6.700000       India,In         2009         -1
12     12   39   $44k-$99k  0.000000       India,In         1999         -1
13     13   25   $44k-$99k -1.000000  Australia Aus         2019       TRUE
14     14   66   $44k-$99k  4.000000  Australia Aus         2020       TRUE
15     15   44  $88k-$101k  3.000000  Australia Aus         1999         -1
16     16   19   $19k-$40k  4.500000       India,In         1984         -1
17     17   39   $44k-$99k  5.300000    New York,Ny         1943       TRUE
18     18   35   $44k-$99k  6.700000    New York,Ny         1954       TRUE
19     19   32   $44k-$99k  3.300000    New York,Ny         1955       TRUE
20     20   39   $44k-$99k  5.700000    New York,Ny         1944       TRUE
21     21   35   $44k-$99k  5.000000    New York,Ny         1946         -1
22     22   19   $55k-$66k  7.800000    New York,Ny         1988       TRUE
23     23   39   $44k-$99k  2.400000    New York,Ny         1999       TRUE
24     24   13   $44k-$99k -1.000000    New York,Ny         1987         -1
25     25   55   $44k-$99k  0.000000  Australia Aus         1980       TRUE
26     26   39   $55k-$66k  3.528571       India,In         1934       TRUE
27     27   52   $44k-$99k  5.400000       India,In         1935         -1
28     28   39   $39k-$88k  3.400000  Australia Aus         1932         -1

In [ ]:
# Step 2: Clean 'Salary' column and convert to integer
df['Salary'] = df['Salary'].astype(str).str.replace('$', '', regex=False).str.replace('k', '000', regex=False)
df['Salary'] = df['Salary'].apply(lambda x: int(x.split('-')[0]))

In [ ]:
# Step 3: Replace negative rating values with positive values
df['Rating'] = df['Rating'].apply(lambda x: x if x > 0 else 1.0)

In [ ]:
# Step 4: Clean 'Location' column to include only country names
df['Location'] = df['Location'].str.split(',').str[-1].str.strip()

In [ ]:
print(df)

    Index  Age  Salary    Rating       Location  Established Easy Apply
0       0   44   44000  5.400000             In         1999       TRUE
1       1   66   55000  3.500000             Ny         2002       TRUE
2       2   39   77000  1.000000             Ny           -1         -1
3       3   64   44000  4.400000       India In         1988         -1
4       4   25   44000  6.400000  Australia Aus         2002         -1
5       5   44   77000  1.400000             In         1999       TRUE
6       6   21   44000  1.000000             Ny           -1         -1
7       7   44   44000  1.000000  Australia Aus           -1         -1
8       8   35   44000  5.400000             Ny           -1         -1
9       9   22   44000  7.700000             In           -1       TRUE
10     10   55   10000  5.400000             In         2008       TRUE
11     11   44   10000  6.700000             In         2009         -1
12     12   39   44000  1.000000             In         1999         -1
13     13   25   44000  1.000000  Australia Aus         2019       TRUE
14     14   66   44000  4.000000  Australia Aus         2020       TRUE
15     15   44   88000  3.000000  Australia Aus         1999         -1
16     16   19   19000  4.500000             In         1984         -1
17     17   39   44000  5.300000             Ny         1943       TRUE
18     18   35   44000  6.700000             Ny         1954       TRUE
19     19   32   44000  3.300000             Ny         1955       TRUE
20     20   39   44000  5.700000             Ny         1944       TRUE
21     21   35   44000  5.000000             Ny         1946         -1
22     22   19   55000  7.800000             Ny         1988       TRUE
23     23   39   44000  2.400000             Ny         1999       TRUE
24     24   13   44000  1.000000             Ny         1987         -1
25     25   55   44000  1.000000  Australia Aus         1980       TRUE
26     26   39   55000  3.528571             In         1934       TRUE
27     27   52   44000  5.400000             In         1935         -1
28     28   39   39000  3.400000  Australia Aus         1932         -1

In [ ]:
# Replace 'In' with 'India', 'Australia Aus' with 'Australia', and 'Ny' with 'New York' in the 'Location' column
df['Location'] = df['Location'].replace({'In': 'India', 'Australia Aus': 'Australia', 'Ny': 'New York'})

In [ ]:
print(df)

    Index  Age  Salary    Rating   Location  Established Easy Apply
0       0   44   44000  5.400000      India         1999       TRUE
1       1   66   55000  3.500000   New York         2002       TRUE
2       2   39   77000  1.000000   New York           -1         -1
3       3   64   44000  4.400000   India In         1988         -1
4       4   25   44000  6.400000  Australia         2002         -1
5       5   44   77000  1.400000      India         1999       TRUE
6       6   21   44000  1.000000   New York           -1         -1
7       7   44   44000  1.000000  Australia           -1         -1
8       8   35   44000  5.400000   New York           -1         -1
9       9   22   44000  7.700000      India           -1       TRUE
10     10   55   10000  5.400000      India         2008       TRUE
11     11   44   10000  6.700000      India         2009         -1
12     12   39   44000  1.000000      India         1999         -1
13     13   25   44000  1.000000  Australia         2019       TRUE
14     14   66   44000  4.000000  Australia         2020       TRUE
15     15   44   88000  3.000000  Australia         1999         -1
16     16   19   19000  4.500000      India         1984         -1
17     17   39   44000  5.300000   New York         1943       TRUE
18     18   35   44000  6.700000   New York         1954       TRUE
19     19   32   44000  3.300000   New York         1955       TRUE
20     20   39   44000  5.700000   New York         1944       TRUE
21     21   35   44000  5.000000   New York         1946         -1
22     22   19   55000  7.800000   New York         1988       TRUE
23     23   39   44000  2.400000   New York         1999       TRUE
24     24   13   44000  1.000000   New York         1987         -1
25     25   55   44000  1.000000  Australia         1980       TRUE
26     26   39   55000  3.528571      India         1934       TRUE
27     27   52   44000  5.400000      India         1935         -1
28     28   39   39000  3.400000  Australia         1932         -1

In [ ]:
# Step 5: Replace '-1' values in the 'Established' column with 'UNKNOWN'
df['Established'] = df['Established'].replace(-1, 'UNKNOWN')

In [ ]:
print(df)

    Index  Age  Salary    Rating   Location Established Easy Apply
0       0   44   44000  5.400000      India        1999       TRUE
1       1   66   55000  3.500000   New York        2002       TRUE
2       2   39   77000  1.000000   New York     UNKNOWN         -1
3       3   64   44000  4.400000   India In        1988         -1
4       4   25   44000  6.400000  Australia        2002         -1
5       5   44   77000  1.400000      India        1999       TRUE
6       6   21   44000  1.000000   New York     UNKNOWN         -1
7       7   44   44000  1.000000  Australia     UNKNOWN         -1
8       8   35   44000  5.400000   New York     UNKNOWN         -1
9       9   22   44000  7.700000      India     UNKNOWN       TRUE
10     10   55   10000  5.400000      India        2008       TRUE
11     11   44   10000  6.700000      India        2009         -1
12     12   39   44000  1.000000      India        1999         -1
13     13   25   44000  1.000000  Australia        2019       TRUE
14     14   66   44000  4.000000  Australia        2020       TRUE
15     15   44   88000  3.000000  Australia        1999         -1
16     16   19   19000  4.500000      India        1984         -1
17     17   39   44000  5.300000   New York        1943       TRUE
18     18   35   44000  6.700000   New York        1954       TRUE
19     19   32   44000  3.300000   New York        1955       TRUE
20     20   39   44000  5.700000   New York        1944       TRUE
21     21   35   44000  5.000000   New York        1946         -1
22     22   19   55000  7.800000   New York        1988       TRUE
23     23   39   44000  2.400000   New York        1999       TRUE
24     24   13   44000  1.000000   New York        1987         -1
25     25   55   44000  1.000000  Australia        1980       TRUE
26     26   39   55000  3.528571      India        1934       TRUE
27     27   52   44000  5.400000      India        1935         -1
28     28   39   39000  3.400000  Australia        1932         -1

In [ ]:
# Step 6: Clean 'Easy Apply' column to have consistent boolean values
df['Easy Apply'] = df['Easy Apply'].astype(str).str.capitalize().map({'True': True, 'False': False, '-1': False}).fillna(False)

In [ ]:
print(df)

    Index  Age  Salary    Rating   Location Established  Easy Apply
0       0   44   44000  5.400000      India        1999        True
1       1   66   55000  3.500000   New York        2002        True
2       2   39   77000  1.000000   New York     UNKNOWN       False
3       3   64   44000  4.400000   India In        1988       False
4       4   25   44000  6.400000  Australia        2002       False
5       5   44   77000  1.400000      India        1999        True
6       6   21   44000  1.000000   New York     UNKNOWN       False
7       7   44   44000  1.000000  Australia     UNKNOWN       False
8       8   35   44000  5.400000   New York     UNKNOWN       False
9       9   22   44000  7.700000      India     UNKNOWN        True
10     10   55   10000  5.400000      India        2008        True
11     11   44   10000  6.700000      India        2009       False
12     12   39   44000  1.000000      India        1999       False
13     13   25   44000  1.000000  Australia        2019        True
14     14   66   44000  4.000000  Australia        2020        True
15     15   44   88000  3.000000  Australia        1999       False
16     16   19   19000  4.500000      India        1984       False
17     17   39   44000  5.300000   New York        1943        True
18     18   35   44000  6.700000   New York        1954        True
19     19   32   44000  3.300000   New York        1955        True
20     20   39   44000  5.700000   New York        1944        True
21     21   35   44000  5.000000   New York        1946       False
22     22   19   55000  7.800000   New York        1988        True
23     23   39   44000  2.400000   New York        1999        True
24     24   13   44000  1.000000   New York        1987       False
25     25   55   44000  1.000000  Australia        1980        True
26     26   39   55000  3.528571      India        1934        True
27     27   52   44000  5.400000      India        1935       False
28     28   39   39000  3.400000  Australia        1932       False

In [ ]:
# Function to convert salary range string to tuple
def salary_range_to_tuple(salary_range_str):
    # Remove "$" and "k" from the string
    salary_range_str = salary_range_str.replace('$', '').replace('k', '')
    # Split the string by "-"
    start_salary, end_salary = map(int, salary_range_str.split('-'))
    return (start_salary * 1000, end_salary * 1000)

# Dictionary containing previous salary ranges
previous_salary_ranges = {
    0: "$44k-$99k",
    1: "$55k-$66k",
    2: "$77k-$89k",
    3: "$44k-$99k",
    4: "$44k-$99k",
    5: "$77k-$89k",
    6: "$44k-$99k",
    7: "$44k-$99k",
    8: "$44k-$99k",
    9: "$44k-$99k",
    10: "$10k-$49k",
    11: "$10k-$49k",
    12: "$44k-$99k",
    13: "$44k-$99k",
    14: "$44k-$99k",
    15: "$88k-$101k",
    16: "$19k-$40k",
    17: "$44k-$99k",
    18: "$44k-$99k",
    19: "$44k-$99k",
    20: "$44k-$99k",
    21: "$44k-$99k",
    22: "$55k-$66k",
    23: "$44k-$99k",
    24: "$44k-$99k",
    25: "$44k-$99k",
    26: "$55k-$66k",
    27: "$44k-$99k",
    28: "$39k-$88k"
}

# Update Salary column in the current dataset
df['Salary'] = df.index.map(lambda idx: salary_range_to_tuple(previous_salary_ranges[idx]))

# Display the updated dataset
print(df)

    Index  Age           Salary    Rating   Location Established  Easy Apply
0       0   44   (44000, 99000)  5.400000      India        1999        True
1       1   66   (55000, 66000)  3.500000   New York        2002        True
2       2   39   (77000, 89000)  1.000000   New York     UNKNOWN       False
3       3   64   (44000, 99000)  4.400000   India In        1988       False
4       4   25   (44000, 99000)  6.400000  Australia        2002       False
5       5   44   (77000, 89000)  1.400000      India        1999        True
6       6   21   (44000, 99000)  1.000000   New York     UNKNOWN       False
7       7   44   (44000, 99000)  1.000000  Australia     UNKNOWN       False
8       8   35   (44000, 99000)  5.400000   New York     UNKNOWN       False
9       9   22   (44000, 99000)  7.700000      India     UNKNOWN        True
10     10   55   (10000, 49000)  5.400000      India        2008        True
11     11   44   (10000, 49000)  6.700000      India        2009       False
12     12   39   (44000, 99000)  1.000000      India        1999       False
13     13   25   (44000, 99000)  1.000000  Australia        2019        True
14     14   66   (44000, 99000)  4.000000  Australia        2020        True
15     15   44  (88000, 101000)  3.000000  Australia        1999       False
16     16   19   (19000, 40000)  4.500000      India        1984       False
17     17   39   (44000, 99000)  5.300000   New York        1943        True
18     18   35   (44000, 99000)  6.700000   New York        1954        True
19     19   32   (44000, 99000)  3.300000   New York        1955        True
20     20   39   (44000, 99000)  5.700000   New York        1944        True
21     21   35   (44000, 99000)  5.000000   New York        1946       False
22     22   19   (55000, 66000)  7.800000   New York        1988        True
23     23   39   (44000, 99000)  2.400000   New York        1999        True
24     24   13   (44000, 99000)  1.000000   New York        1987       False
25     25   55   (44000, 99000)  1.000000  Australia        1980        True
26     26   39   (55000, 66000)  3.528571      India        1934        True
27     27   52   (44000, 99000)  5.400000      India        1935       False
28     28   39   (39000, 88000)  3.400000  Australia        1932       False

In [ ]:
# Update Salary column in the current dataset with formatted salary strings
df['Salary'] = df['Salary'].str.replace('$', '', regex=False).str.replace('k', '000', regex=False).str.split('-').apply(lambda x: f"{int(x[0])} - {int(x[1])}")

# Display the updated dataset
print(df)

    Index  Age          Salary    Rating   Location Established  Easy Apply
0       0   44   44000 - 99000  5.400000      India        1999        True
1       1   66   55000 - 66000  3.500000   New York        2002        True
2       2   39   77000 - 89000  1.000000   New York     UNKNOWN       False
3       3   64   44000 - 99000  4.400000   India In        1988       False
4       4   25   44000 - 99000  6.400000  Australia        2002       False
5       5   44   77000 - 89000  1.400000      India        1999        True
6       6   21   44000 - 99000  1.000000   New York     UNKNOWN       False
7       7   44   44000 - 99000  1.000000  Australia     UNKNOWN       False
8       8   35   44000 - 99000  5.400000   New York     UNKNOWN       False
9       9   22   44000 - 99000  7.700000      India     UNKNOWN        True
10     10   55   10000 - 49000  5.400000      India        2008        True
11     11   44   10000 - 49000  6.700000      India        2009       False
12     12   39   44000 - 99000  1.000000      India        1999       False
13     13   25   44000 - 99000  1.000000  Australia        2019        True
14     14   66   44000 - 99000  4.000000  Australia        2020        True
15     15   44  88000 - 101000  3.000000  Australia        1999       False
16     16   19   19000 - 40000  4.500000      India        1984       False
17     17   39   44000 - 99000  5.300000   New York        1943        True
18     18   35   44000 - 99000  6.700000   New York        1954        True
19     19   32   44000 - 99000  3.300000   New York        1955        True
20     20   39   44000 - 99000  5.700000   New York        1944        True
21     21   35   44000 - 99000  5.000000   New York        1946       False
22     22   19   55000 - 66000  7.800000   New York        1988        True
23     23   39   44000 - 99000  2.400000   New York        1999        True
24     24   13   44000 - 99000  1.000000   New York        1987       False
25     25   55   44000 - 99000  1.000000  Australia        1980        True
26     26   39   55000 - 66000  3.528571      India        1934        True
27     27   52   44000 - 99000  5.400000      India        1935       False
28     28   39   39000 - 88000  3.400000  Australia        1932       False

In [ ]:
# Round off the Rating column to one decimal point
df['Rating'] = df['Rating'].round(1)

# Display the updated dataset
print(df)

    Index  Age          Salary  Rating   Location Established  Easy Apply
0       0   44   44000 - 99000     5.4      India        1999        True
1       1   66   55000 - 66000     3.5   New York        2002        True
2       2   39   77000 - 89000     1.0   New York     UNKNOWN       False
3       3   64   44000 - 99000     4.4   India In        1988       False
4       4   25   44000 - 99000     6.4  Australia        2002       False
5       5   44   77000 - 89000     1.4      India        1999        True
6       6   21   44000 - 99000     1.0   New York     UNKNOWN       False
7       7   44   44000 - 99000     1.0  Australia     UNKNOWN       False
8       8   35   44000 - 99000     5.4   New York     UNKNOWN       False
9       9   22   44000 - 99000     7.7      India     UNKNOWN        True
10     10   55   10000 - 49000     5.4      India        2008        True
11     11   44   10000 - 49000     6.7      India        2009       False
12     12   39   44000 - 99000     1.0      India        1999       False
13     13   25   44000 - 99000     1.0  Australia        2019        True
14     14   66   44000 - 99000     4.0  Australia        2020        True
15     15   44  88000 - 101000     3.0  Australia        1999       False
16     16   19   19000 - 40000     4.5      India        1984       False
17     17   39   44000 - 99000     5.3   New York        1943        True
18     18   35   44000 - 99000     6.7   New York        1954        True
19     19   32   44000 - 99000     3.3   New York        1955        True
20     20   39   44000 - 99000     5.7   New York        1944        True
21     21   35   44000 - 99000     5.0   New York        1946       False
22     22   19   55000 - 66000     7.8   New York        1988        True
23     23   39   44000 - 99000     2.4   New York        1999        True
24     24   13   44000 - 99000     1.0   New York        1987       False
25     25   55   44000 - 99000     1.0  Australia        1980        True
26     26   39   55000 - 66000     3.5      India        1934        True
27     27   52   44000 - 99000     5.4      India        1935       False
28     28   39   39000 - 88000     3.4  Australia        1932       False

In [ ]:

# Displaying the updated DataFrame
print(df)

    Index  Age  Rating   Location Established  Easy Apply Minimum Salary  \
0       0   44     5.4      India        1999        True          44000
1       1   66     3.5   New York        2002        True          55000
2       2   39     1.0   New York     UNKNOWN       False          77000
3       3   64     4.4   India In        1988       False          44000
4       4   25     6.4  Australia        2002       False          44000
5       5   44     1.4      India        1999        True          77000
6       6   21     1.0   New York     UNKNOWN       False          44000
7       7   44     1.0  Australia     UNKNOWN       False          44000
8       8   35     5.4   New York     UNKNOWN       False          44000
9       9   22     7.7      India     UNKNOWN        True          44000
10     10   55     5.4      India        2008        True          10000
11     11   44     6.7      India        2009       False          10000
12     12   39     1.0      India        1999       False          44000
13     13   25     1.0  Australia        2019        True          44000
14     14   66     4.0  Australia        2020        True          44000
15     15   44     3.0  Australia        1999       False          88000
16     16   19     4.5      India        1984       False          19000
17     17   39     5.3   New York        1943        True          44000
18     18   35     6.7   New York        1954        True          44000
19     19   32     3.3   New York        1955        True          44000
20     20   39     5.7   New York        1944        True          44000
21     21   35     5.0   New York        1946       False          44000
22     22   19     7.8   New York        1988        True          55000
23     23   39     2.4   New York        1999        True          44000
24     24   13     1.0   New York        1987       False          44000
25     25   55     1.0  Australia        1980        True          44000
26     26   39     3.5      India        1934        True          55000
27     27   52     5.4      India        1935       False          44000
28     28   39     3.4  Australia        1932       False          39000

   Maximum Salary
0           99000
1           66000
2           89000
3           99000
4           99000
5           89000
6           99000
7           99000
8           99000
9           99000
10          49000
11          49000
12          99000
13          99000
14          99000
15         101000
16          40000
17          99000
18          99000
19          99000
20          99000
21          99000
22          66000
23          99000
24          99000
25          99000
26          66000
27          99000
28          88000